
  <?php
    require('fpdf.php');
    define('FPDF_FONTPATH','font/');

    $manager = new MongoDB\Driver\Manager("mongodb://testclstermongodb-qdoan.mongodb.net)");
    $query = new MongoDB\Driver\Query([]);
    $rows = $manager->executeQuery("onelifebooking.phpbasic",$query);
    db.phpbasic.find({"Customername":"korn"})
    $pdf = new FPDF();
    $pdf -> AddPage();
    $pdf->AddFont('angsa','','angsa.php');
    $pdf->SetFont('angsa','',20);
    $pdf->Cell(0,10,'Welcome to www.GoldTrader.Com',0,1,"C");
    $pdf->Cell(0,10,iconv( 'UTF-8','TIS-620','วันที่.......เดือน..................ปี........'),0,1);
    $pdf->Cell(0,10,iconv( 'UTF-8','TIS-620','ชื่อ................................นามสกุล...........................................................................'),0,1);
    $pdf->Cell(0,10,iconv( 'UTF-8','TIS-620','จำนวนเงินที่จอง...................................................จำนวนทอง............................................'),0,1);
    $pdf->Cell(0,10,iconv( 'UTF-8','TIS-620','รับทองก่อน.......................................................คงเหลือทองจำนวน......................................'),0,1);
    $pdf->Cell(0,10,iconv( 'UTF-8','TIS-620','วันที่รับทอง.........................................................................................................................'),0,1);
    $pdf->Cell(0,10,iconv( 'UTF-8','TIS-620','ลงชื่อผู้ซื้อทอง......................................................................................................................'),0,1);
    $pdf->Cell(0,10,iconv( 'UTF-8','TIS-620','ลงชื่อผู้รับเงิน.......................................................................................................................'),0,1);
    $pdf->Output();
  ?>
